TexasInstruments/c2000ware-core-sdk/driverlib/f28e12x/examples/adc/adc_ex7_ppb_offset.syscfg

/**
 * Import the modules used in this configuration.
 */
const adc     = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1    = adc.addInstance();
const asysctl = scripting.addModule("/driverlib/asysctl.js");

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name                 = "myADC0";
adc1.adcClockPrescaler     = "ADC_CLK_DIV_1_0";
adc1.interruptPulseMode    = "ADC_PULSE_END_OF_CONV";
adc1.enabledSOCs           = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc1.soc0SampleWindow      = 4;
adc1.soc1SampleWindow      = 4;
adc1.soc0Channel           = "ADC_CH_ADCIN5";
adc1.soc1Channel           = "ADC_CH_ADCIN5";
adc1.enabledInts           = ["ADC_INT_NUMBER1"];
adc1.enableInterrupt1      = true;
adc1.interrupt1SOCSource   = "ADC_INT_TRIGGER_EOC1";
adc1.enabledPPBs           = ["ADC_PPB_NUMBER1"];
adc1.ppb1SOCNumber         = "ADC_SOC_NUMBER1";
adc1.ppb1CalibrationOffset = 30;

asysctl.analogReference         = "INTERNAL";
asysctl.analogReferenceVoltage  = "1P65";
